2020.06.09.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[http://alan.petitepomme.net/cwn/2020.06.02.html][Previous Week]] [[http://alan.petitepomme.net/cwn/index.html][Up]] [[http://alan.petitepomme.net/cwn/2020.06.16.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of June 02 to 09, 2020.

#+TOC: headlines 1


* Multicore Update: April 2020, with a preprint paper
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/multicore-update-april-2020-with-a-preprint-paper/5630/26

** Continuing this thread, Daniel Bünzli asked and KC Sivaramakrishnan replied


#+begin_quote
One thing that I didn’t get from the paper is how exactly  ~ConcurMinor~  breaks the current FFI and the impact it
would have on the existing eco-system, on a scale from “it affect all projects” to “only people doing  *that*
fancy thing” :–) ?
#+end_quote

All the projects that use the C API. The details are here:
https://github.com/ocaml-multicore/ocaml-multicore/wiki/C-API-changes

#+begin_quote
At the end of the paper it seems you make the point that  ~ParMinor~  is the solution to go with for the time
being. Does this means you are going to leave behind the work done on  ~ConcurMinor~  or do you intend to continue
to maintain it ?
#+end_quote

We don't intend to maintain it. It is quite a bit of work to maintain and port the changes across two different GCs.
~ParMinor~ GC is now at 4.11 branch point (the default multicore compiler is 4.10 + ParMinor now). The ~ConcMinor~ is
at 4.06.1.

Given that ~ConcMinor~ breaks the C API, the ecosystem would have to be fixed for ~ConcMinor~ to be useful. The code
changes are indeed intricate; the differences are not just in the minor GC, but the compilers internal use of the C
API. It will be quite a bit of work to keep both GCs in the same source distribution.
      

** Guillaume Munch-Maccagnoni then said


#+begin_quote
Given that ~ConcMinor~ breaks the C API, the ecosystem would have to be fixed for ~ConcMinor~ to be useful.
#+end_quote

I do not think this is necessarily true.

Here is why I think so, but be warned that this is preliminary as I do not have time to explore this idea further on
my own at the moment.

*** State in Rust

Breaking the C API is a consequence of deciding that all single-threaded shared mutable state must assume they are
also shared between threads. So a new read barrier is used to promote values when read from another thread. But for
data types that were correct up to now, users must also be careful to avoid races from now on... for instance by
avoiding sharing values of such types between domains.

One lesson of Rust is that there are different kinds of mutable state, for different usages, with different means to
achieve thread-safety.

The closest there is to current OCaml's ~mutable~ is the notion of single-threaded multiple-writers mutable state
(_~Cell~_). It is made thread-safe in Rust by statically preventing values containing ~Cell~ from crossing thread
boundaries (by virtue of not having the _~Send~ trait_). The same restriction is used to make some data structures
more efficient by avoiding the cost of synchronisation (cf. the reference-counting pointer ~Rc~ vs. the atomic
reference-counting pointer ~Arc~).

This is not enough by itself, and Rust offers other kinds of state for communicating and sharing values between
threads.

_~UnsafeCell~_ like Ocaml multicore's ~mutable~ (though yours is safe thanks to the work on the memory model): it has
almost no restriction and can be sent across domains, but the user is likewise told to “avoid data races”. It is
rarely used alone, but together with type abstraction it can be used to program safe concurrent data structures.

Lastly, the default notion of state in Rust is linear state, which can be sent freely across threads. Thread-safety
is ensured by restricting aliasing using the ownership and borrowing discipline.

