2020.06.09.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-06-09 Tue 10:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="http://alan.petitepomme.net/cwn/2020.06.02.html">Previous Week</a> <a href="http://alan.petitepomme.net/cwn/index.html">Up</a> <a href="http://alan.petitepomme.net/cwn/2020.06.16.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of June 02 to 09, 2020.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">Multicore Update: April 2020, with a preprint paper</a></li>
<li><a href="#2">BAP 2.1.0 Release</a></li>
<li><a href="#3">Migrating an Async project to Lwt, a short primer</a></li>
<li><a href="#4">jose 0.4.0</a></li>
<li><a href="#5">OCaml 4.11.0, second alpha release</a></li>
<li><a href="#6">OCaml Workshop 2020: Call for Volunteers</a></li>
<li><a href="#7">Introduction to Lwt</a></li>
<li><a href="#8">Other OCaml News</a></li>
<li><a href="#org3e1b2ac">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgfabaa27" class="outline-2">
<h2 id="1"><a id="orgfabaa27"></a>Multicore Update: April 2020, with a preprint paper</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/multicore-update-april-2020-with-a-preprint-paper/5630/26">https://discuss.ocaml.org/t/multicore-update-april-2020-with-a-preprint-paper/5630/26</a>
</p>
</div>

<div id="outline-container-org7a5ce73" class="outline-3">
<h3 id="org7a5ce73">Continuing this thread, Daniel Bünzli asked and KC Sivaramakrishnan replied</h3>
<div class="outline-text-3" id="text-org7a5ce73">
<blockquote>
<p>
One thing that I didn’t get from the paper is how exactly  <code>ConcurMinor</code>  breaks the current FFI and the impact it
would have on the existing eco-system, on a scale from “it affect all projects” to “only people doing  <b>that</b>
fancy thing” :–) ?
</p>
</blockquote>

<p>
All the projects that use the C API. The details are here:
<a href="https://github.com/ocaml-multicore/ocaml-multicore/wiki/C-API-changes">https://github.com/ocaml-multicore/ocaml-multicore/wiki/C-API-changes</a>
</p>

<blockquote>
<p>
At the end of the paper it seems you make the point that  <code>ParMinor</code>  is the solution to go with for the time
being. Does this means you are going to leave behind the work done on  <code>ConcurMinor</code>  or do you intend to continue
to maintain it ?
</p>
</blockquote>

<p>
We don't intend to maintain it. It is quite a bit of work to maintain and port the changes across two different GCs.
<code>ParMinor</code> GC is now at 4.11 branch point (the default multicore compiler is 4.10 + ParMinor now). The <code>ConcMinor</code> is
at 4.06.1.
</p>

<p>
Given that <code>ConcMinor</code> breaks the C API, the ecosystem would have to be fixed for <code>ConcMinor</code> to be useful. The code
changes are indeed intricate; the differences are not just in the minor GC, but the compilers internal use of the C
API. It will be quite a bit of work to keep both GCs in the same source distribution.
</p>
</div>
</div>


<div id="outline-container-orge339777" class="outline-3">
<h3 id="orge339777">Guillaume Munch-Maccagnoni then said</h3>
<div class="outline-text-3" id="text-orge339777">
<blockquote>
<p>
Given that <code>ConcMinor</code> breaks the C API, the ecosystem would have to be fixed for <code>ConcMinor</code> to be useful.
</p>
</blockquote>

<p>
I do not think this is necessarily true.
</p>

<p>
Here is why I think so, but be warned that this is preliminary as I do not have time to explore this idea further on
my own at the moment.
</p>
</div>

<div id="outline-container-org0d4eafb" class="outline-4">
<h4 id="org0d4eafb">State in Rust</h4>
<div class="outline-text-4" id="text-org0d4eafb">
<p>
Breaking the C API is a consequence of deciding that all single-threaded shared mutable state must assume they are
also shared between threads. So a new read barrier is used to promote values when read from another thread. But for
data types that were correct up to now, users must also be careful to avoid races from now on&#x2026; for instance by
avoiding sharing values of such types between domains.
</p>

<p>
One lesson of Rust is that there are different kinds of mutable state, for different usages, with different means to
achieve thread-safety.
</p>

<p>
The closest there is to current OCaml's <code>mutable</code> is the notion of single-threaded multiple-writers mutable state
(<span class="underline"><code>Cell</code></span>). It is made thread-safe in Rust by statically preventing values containing <code>Cell</code> from crossing thread
boundaries (by virtue of not having the <span class="underline"><code>Send</code> trait</span>). The same restriction is used to make some data structures
more efficient by avoiding the cost of synchronisation (cf. the reference-counting pointer <code>Rc</code> vs. the atomic
reference-counting pointer <code>Arc</code>).
</p>

<p>
This is not enough by itself, and Rust offers other kinds of state for communicating and sharing values between
threads.
</p>

<p>
<span class="underline"><code>UnsafeCell</code></span> like Ocaml multicore's <code>mutable</code> (though yours is safe thanks to the work on the memory model): it has
almost no restriction and can be sent across domains, but the user is likewise told to “avoid data races”. It is
rarely used alone, but together with type abstraction it can be used to program safe concurrent data structures.
</p>

<p>
Lastly, the default notion of state in Rust is linear state, which can be sent freely across threads. Thread-safety
is ensured by restricting aliasing using the ownership and borrowing discipline.
</p>
</div>
</div>
