2020.06.09.org
*** A backwards-compatible concurrent collector?

If I had to imagine a backwards-compatible OCaml with static control of interference à la Rust based on ~ConcMinor~,
it would distinguish the three kinds of state (concretely with other keywords in addition to ~mutable~). ~mutable~
would keep its current meaning of single-domain, multiple-writers state and not require a read barrier, and in
particular preserve the API. (I count systhreads as single-threaded for this purpose, since here it means "sharing
the same minor heap".)

Programs could progressively transition to other kinds of state when parallelising the program. Concretely, a data
structure like ~Stack.t~, instead of becoming racy, would keep its current meaning, but users could replace it with a
linear stack or a concurrent stack, two data structures distinct from the first one, when parallelizing their
programs.

So how could this fit with the current plans? It is not entirely clear to me. If people start to rely on parallelism
in an unstructured way (e.g. no clear distinction between different kinds of data types arising from different ways
of ensuring thread-safety) then one will also lose the ability to retrofit ~ConcMinor~ in a backwards-compatible
manner (by losing the information that the current ~mutable~ API is single-threaded). The API breakage of ~ConcMinor~
which might only be virtual right now (if I trust this preliminary, not fully-explored idea) will become real.
(Further difficulties arise with the emulation of the ~Thread~ library with domains, but this could be changed
later.)

But if users are provided in advance with a general direction for a model of control of interference this might
happen differently. And eventually having such a model is desirable in any case, as it helps parallelizing programs
(for instance the Firefox people reported that they had attempted and failed twice to parallelise the CSS engine in
C++ before succeeding with Rust). Furthermore, in an imaginary retrofitting of ~ConcMinor~, one could imagine
enforcing something like the ~Send~ trait at the level of the read barrier until there is a better way (there would
be two kinds of barriers, one of which would raise an exception if a state happened to be incorrectly shared across
domains, and not be required in the FFI).

I find ~ConcMinor~ interesting from a systems programming perspective compared to the stop-the-world collector
because it could (I hope) offer possibilities such as having a low-latency domain communicating with a higher-latency
domain. Moreover the performance cost of the read barrier might be lower in this scheme if it could be removed for
all but the concurrent data structures.
      



* BAP 2.1.0 Release
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/ann-bap-2-1-0-release/5906/1

