2020.06.09.org
** Ivan Gotovchits announced


The Carnegie Mellon University Binary Analysis Platform ([[https://github.com/BinaryAnalysisPlatform/bap][CMU BAP]]) is a suite of utilities and libraries that
enables analysis of programs that are represented as machine code (aka binaries). CMU BAP is written in OCaml and
uses plugin-based architecture to enable extensibility. We also have a domain-specific language, called Primus Lisp,
that we use to write analysis, specify verification conditions, interact with the built-in SMT solver, and model the
semantics of machine instructions and functions.

The 2.1.0 Release is very rich in [[https://github.com/BinaryAnalysisPlatform/bap/releases/tag/v2.1.0][new features]] but the most prominent addition is the new [[https://github.com/BinaryAnalysisPlatform/bap/pull/1105][symbolic executor]]
mode for the Primus framework. We also significantly updated the Primus framework, integrated it with our new
Knowledge Base, which was introduced in the BAP 2.0 release; we made our interpreter much faster; we added the
systems and components facilities, inspired by Common Lisp; and we implemented a gradual type checker for Primus Lisp
with type inference. We also added an ability to represent machine instructions as intrinsic functions so now it is
possible to express their semantics using Primus Lisp since we added IEEE754 primitives to the Lisp interpreter.

As usual, we upgraded BAP to the newer versions of the Core library and OCaml (we now support OCaml versions from
4.07 to 4.09). We also significantly improved our build times and added an optional omake backend, which we are using
in-house.

From the user perspective, one of the key features of BAP as an analysis platform is that you can run BAP on binaries
that you can't run otherwise, either because they need special hardware or software, or need to interact with the
outside world. In the past couple of months, we have run BAP on various firmware and found numerous zero-day
vulnerabilities, particular, we were able to find critical vulnerabilities in the VxWorks operating system that runs
on, potentially, billions of devices including mission-critical and military appliances.

As always, questions, suggestions, and opinions are very welcome!
      



* Migrating an Async project to Lwt, a short primer
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/migrating-an-async-project-to-lwt-a-short-primer/5908/1

** Michael Bacarella announced


Consider this a post where I think aloud about my experience migrating an Async project to Lwt.  I've spent about a
weekend doing such a thing, and if, in the process of talking about it here I can save a few people an hour or two
(or perhaps inspire confidence to take such a project on in the first place) then it will have been worthwhile.

This wouldn't be a complete post if I didn't also mention @dkim's [[https://github.com/dkim/rwo-lwt][translation of Real World OCaml's Async examples
to Lwt]]

This was born out of a previous effort where I [[https://discuss.ocaml.org/t/best-practices-on-mixing-lwt-and-async/5372][tried to mix Lwt and Async in the same
project]].   This didn't go so well, so I
tried converting the whole thing to Lwt, and it turns out adapting to Lwt if you're an Async person is actually much
easier than I thought it would be.

*** Basics

Both libraries involve promises/futures.  Async calls its promises
~Deferred.t~, whereas in Lwt they're called ~Lwt.t~.

In Async you start your program by saying ~never_returns (Scheduler.go ())~ or ~Command.async_spec~ after you set up
your initial ~Deferred.t~.

In Lwt you say ~Lwt_main.run~ on a top-level ~Lwt.t~ argument.  Note you can
re-run ~Lwt_main.run~ in a single program as many times as you want, but
perhaps you shouldn't run multiple ~Lwt_main.run~ in parallel.

There's an easy correspondence between basic operators.

| Async | Lwt |
|---|---|
| ~Deferred.bind~ | ~Lwt.bind~ |
| ~Deferred.return~ | ~Lwt.return~ |
| ~>>=~ | ~>>=~ |
| ~Deferred.map~ | ~Lwt.map~ |
| ~>>\vert~ | ~>\vert=~ |
| ~Deferred.don't_wait_for~ | ~Lwt.async~ |
| ~In_thread.run~ | ~Lwt_preemptive.detach~ |

