2020.06.09.html

<div id="outline-container-orgee857f0" class="outline-3">
<h3 id="orgee857f0">Ivan Gotovchits announced</h3>
<div class="outline-text-3" id="text-orgee857f0">
<p>
The Carnegie Mellon University Binary Analysis Platform (<a href="https://github.com/BinaryAnalysisPlatform/bap">CMU BAP</a>) is a suite of utilities and libraries that
enables analysis of programs that are represented as machine code (aka binaries). CMU BAP is written in OCaml and
uses plugin-based architecture to enable extensibility. We also have a domain-specific language, called Primus Lisp,
that we use to write analysis, specify verification conditions, interact with the built-in SMT solver, and model the
semantics of machine instructions and functions.
</p>

<p>
The 2.1.0 Release is very rich in <a href="https://github.com/BinaryAnalysisPlatform/bap/releases/tag/v2.1.0">new features</a> but the most prominent addition is the new <a href="https://github.com/BinaryAnalysisPlatform/bap/pull/1105">symbolic executor</a>
mode for the Primus framework. We also significantly updated the Primus framework, integrated it with our new
Knowledge Base, which was introduced in the BAP 2.0 release; we made our interpreter much faster; we added the
systems and components facilities, inspired by Common Lisp; and we implemented a gradual type checker for Primus Lisp
with type inference. We also added an ability to represent machine instructions as intrinsic functions so now it is
possible to express their semantics using Primus Lisp since we added IEEE754 primitives to the Lisp interpreter.
</p>

<p>
As usual, we upgraded BAP to the newer versions of the Core library and OCaml (we now support OCaml versions from
4.07 to 4.09). We also significantly improved our build times and added an optional omake backend, which we are using
in-house.
</p>

<p>
From the user perspective, one of the key features of BAP as an analysis platform is that you can run BAP on binaries
that you can't run otherwise, either because they need special hardware or software, or need to interact with the
outside world. In the past couple of months, we have run BAP on various firmware and found numerous zero-day
vulnerabilities, particular, we were able to find critical vulnerabilities in the VxWorks operating system that runs
on, potentially, billions of devices including mission-critical and military appliances.
</p>

<p>
As always, questions, suggestions, and opinions are very welcome!
</p>
</div>
</div>
</div>




<div id="outline-container-orge05777d" class="outline-2">
<h2 id="3"><a id="orge05777d"></a>Migrating an Async project to Lwt, a short primer</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/migrating-an-async-project-to-lwt-a-short-primer/5908/1">https://discuss.ocaml.org/t/migrating-an-async-project-to-lwt-a-short-primer/5908/1</a>
</p>
</div>

<div id="outline-container-org6743415" class="outline-3">
<h3 id="org6743415">Michael Bacarella announced</h3>
<div class="outline-text-3" id="text-org6743415">
<p>
Consider this a post where I think aloud about my experience migrating an Async project to Lwt.  I've spent about a
weekend doing such a thing, and if, in the process of talking about it here I can save a few people an hour or two
(or perhaps inspire confidence to take such a project on in the first place) then it will have been worthwhile.
</p>

<p>
This wouldn't be a complete post if I didn't also mention @dkim's <a href="https://github.com/dkim/rwo-lwt">translation of Real World OCaml's Async examples
to Lwt</a>
</p>

<p>
This was born out of a previous effort where I <a href="https://discuss.ocaml.org/t/best-practices-on-mixing-lwt-and-async/5372">tried to mix Lwt and Async in the same
project</a>.   This didn't go so well, so I
tried converting the whole thing to Lwt, and it turns out adapting to Lwt if you're an Async person is actually much
easier than I thought it would be.
</p>
</div>

<div id="outline-container-org713ba00" class="outline-4">
<h4 id="org713ba00">Basics</h4>
<div class="outline-text-4" id="text-org713ba00">
<p>
Both libraries involve promises/futures.  Async calls its promises
<code>Deferred.t</code>, whereas in Lwt they're called <code>Lwt.t</code>.
</p>

<p>
In Async you start your program by saying <code>never_returns (Scheduler.go ())</code> or <code>Command.async_spec</code> after you set up
your initial <code>Deferred.t</code>.
</p>

<p>
In Lwt you say <code>Lwt_main.run</code> on a top-level <code>Lwt.t</code> argument.  Note you can
re-run <code>Lwt_main.run</code> in a single program as many times as you want, but
perhaps you shouldn't run multiple <code>Lwt_main.run</code> in parallel.
</p>

<p>
There's an easy correspondence between basic operators.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Async</th>
<th scope="col" class="org-left">Lwt</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>Deferred.bind</code></td>
<td class="org-left"><code>Lwt.bind</code></td>
</tr>

<tr>
<td class="org-left"><code>Deferred.return</code></td>
<td class="org-left"><code>Lwt.return</code></td>
</tr>

<tr>
<td class="org-left"><code>&gt;&gt;=</code></td>
<td class="org-left"><code>&gt;&gt;=</code></td>
</tr>

<tr>
<td class="org-left"><code>Deferred.map</code></td>
<td class="org-left"><code>Lwt.map</code></td>
</tr>

<tr>
<td class="org-left"><code>&gt;&gt;&vert;</code></td>
<td class="org-left"><code>&gt;&vert;=</code></td>
</tr>

<tr>
<td class="org-left"><code>Deferred.don't_wait_for</code></td>
<td class="org-left"><code>Lwt.async</code></td>
</tr>

<tr>
<td class="org-left"><code>In_thread.run</code></td>
<td class="org-left"><code>Lwt_preemptive.detach</code></td>
</tr>
</tbody>
</table>
</div>
</div>
