2020.06.09.html

<div id="outline-container-org0cccce5" class="outline-4">
<h4 id="org0cccce5">Starvation worries</h4>
<div class="outline-text-4" id="text-org0cccce5">
<p>
The most important difference between Async and Lwt is that <b>fulfilled promises are acted on immediately</b>,  whereas
Async kinda punts them to the end of a work queue and runs their thunks later.
</p>

<p>
A return loop like this starves the rest of Lwt:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">open </span><span style="color: #228b22;">Lwt.Infix</span>

<span style="color: #000000; font-weight: bold;">let</span> <span style="color: #0000ff;">main</span> () =
  <span style="color: #000000; font-weight: bold;">let</span> <span style="color: #000000; font-weight: bold;">rec</span> <span style="color: #0000ff;">loop</span> () =
    <span style="color: #228b22;">Lwt.</span>return ()
    &gt;&gt;= <span style="color: #a020f0;">fun</span> () -&gt;
    loop ()
  <span style="color: #000000; font-weight: bold;">in</span>
  <span style="color: #228b22;">Lwt.</span>async (loop ());
  <span style="color: #228b22;">Lwt_io.</span>printlf <span style="color: #8b2252;">"this line never prints!"</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #000000; font-weight: bold;">let</span> () = <span style="color: #228b22;">Lwt_main.</span>run main <span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
whereas the corresponding Async loop does not starve:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">open! </span><span style="color: #228b22;">Async</span>

<span style="color: #000000; font-weight: bold;">let</span> <span style="color: #0000ff;">main</span> () =
  <span style="color: #000000; font-weight: bold;">let</span> <span style="color: #000000; font-weight: bold;">rec</span> <span style="color: #0000ff;">loop</span> () =
    <span style="color: #228b22;">Deferred.</span>return ()
    &gt;&gt;= <span style="color: #a020f0;">fun</span> () -&gt;
    loop ()
  <span style="color: #000000; font-weight: bold;">in</span>
  don't_wait_for (loop ());
  printf <span style="color: #8b2252;">"this line does print!\n"</span>;
  return ()
<span style="color: #ff4500;">;;</span>

<span style="color: #000000; font-weight: bold;">let</span> () =
  <span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">cmd</span> = <span style="color: #228b22;">Command.</span>async_spec <span style="color: #008b8b;">~summary</span>:<span style="color: #8b2252;">""</span> <span style="color: #228b22;">Command.Spec.</span>empty main <span style="color: #000000; font-weight: bold;">in</span>
  <span style="color: #228b22;">Command.</span>run cmd
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
Fortunately there's a workaround. You can get something closer to the Async-style behavior in Lwt by using <code>Lwt.yield ()</code> instead of <code>Lwt.return ()</code>.
</p>
</div>
</div>

<div id="outline-container-org741266e" class="outline-4">
<h4 id="org741266e">Spawning threads</h4>
<div class="outline-text-4" id="text-org741266e">
<p>
From time to time you may need to run something in a system thread.   In Async you say <code>In_thread.run</code>, whereas in
Lwt you say <code>Lwt_preemptive.detach</code>.  For simple things they're pretty much interchangeable, but one stumbling point
for me was that in Async you can create a named thread and always use that for the <code>In_thread.run</code>, with multiple
simultaneous dispatches to that thread becoming sequenced.
</p>

<p>
This is really useful for interacting with libraries that aren't so thread friendly.
</p>

<p>
Lwt's detach doesn't provide an easy way to do this out of the box, but I think you can still deal with thread
unfriendly libraries by using the <code>Lwt_preemptive.run_in_main</code> call.
</p>

<p>
Basically, never exit the detach thread you started to interact with your library, and instead have it block on
promise that gets filled through run_in_main.  In this way you can sequence your detached  Lwt thread similarly to
Async.
</p>

<p>
Happy to explain further if this is unclear.
</p>
</div>
</div>

<div id="outline-container-org227dcc6" class="outline-4">
<h4 id="org227dcc6">Other libraries</h4>
<div class="outline-text-4" id="text-org227dcc6">
<p>
<code>Async.Unix</code> has a somewhat built-up conception of the UNIX API, whereas
<code>Lwt_main</code> is more a direct mapping of ocaml's <code>Unix</code> module to promises.
</p>

<p>
Async <code>Clock.every</code> and <code>Clock.after</code> don't have exact analogs, but you can
make new versions pretty simply.
</p>

<p>
Example of a shallow imitation of Async <code>Clock.every</code>
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">let</span> <span style="color: #0000ff;">every</span> <span style="color: #a0522d;">span</span> <span style="color: #a0522d;">f</span> =
  <span style="color: #228b22;">Lwt.</span>async (<span style="color: #a020f0;">fun</span> () -&gt;
    <span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">span</span> = <span style="color: #228b22;">Time.Span.</span>to_sec span <span style="color: #000000; font-weight: bold;">in</span>
    <span style="color: #000000; font-weight: bold;">let</span> <span style="color: #000000; font-weight: bold;">rec</span> <span style="color: #0000ff;">loop</span> () =
      f ();
      <span style="color: #228b22;">Lwt_unix.</span>sleep span
      &gt;&gt;= <span style="color: #a020f0;">fun</span> () -&gt;
      loop ()
    <span style="color: #000000; font-weight: bold;">in</span>
    loop ())
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
<b>Open questions</b>
</p>

<p>
I haven't sorted out a good Lwt substitute that's as comfortable as Async Pipe yet.   Though some combination of
Lwt_stream, Lwt_sequence and  <code>lwt-pipe</code> might fit the bill.  If you just happen to know already feel free to
cluephone.
</p>
</div>
</div>

<div id="outline-container-org4ee61f1" class="outline-4">
<h4 id="org4ee61f1">Closing remarks</h4>
<div class="outline-text-4" id="text-org4ee61f1">
<p>
This is basically everything?  I'm almost suspicious that I'm not having more problems, but will happily accept grace
when it arises.
</p>
</div>
</div>
</div>


<div id="outline-container-orgcc0e012" class="outline-3">
<h3 id="orgcc0e012">Raphaël Proust then said</h3>
<div class="outline-text-3" id="text-orgcc0e012">
<blockquote>
<p>
I haven’t sorted out a good Lwt substitute that’s as comfortable as Async Pipe yet. Though some combination of
Lwt_stream, Lwt_sequence and <code>lwt-pipe</code> might fit the bill. If you just happen to know already feel free to
cluephone.
</p>
</blockquote>

<p>
The Tezos project has a pipe-like module: <a href="https://gitlab.com/tezos/tezos/-/blob/master/src/lib_stdlib/lwt_pipe.mli">https://gitlab.com/tezos/tezos/-/blob/master/src/lib_stdlib/lwt_pipe.mli</a>
It hasn't been released as a standalone library (yet) but it is released as part of the <code>tezos-stdlib</code> package.
</p>

<p>
I haven't used Async's pipe, so I don't know how close of a match it is.
</p>
</div>
</div>
</div>




<div id="outline-container-orgbc8027b" class="outline-2">
<h2 id="4"><a id="orgbc8027b"></a>jose 0.4.0</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-jose-0-4-0/5909/1">https://discuss.ocaml.org/t/ann-jose-0-4-0/5909/1</a>
</p>
</div>
