2020.06.09.txt


Starvation worries
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  The most important difference between Async and Lwt is that *fulfilled
  promises are acted on immediately*, whereas Async kinda punts them to
  the end of a work queue and runs their thunks later.

  A return loop like this starves the rest of Lwt:

  ┌────
  │ open Lwt.Infix
  │ 
  │ let main () =
  │   let rec loop () =
  │     Lwt.return ()
  │     >>= fun () ->
  │     loop ()
  │   in
  │   Lwt.async (loop ());
  │   Lwt_io.printlf "this line never prints!"
  │ ;;
  │ 
  │ let () = Lwt_main.run main ;;
  └────

  whereas the corresponding Async loop does not starve:

  ┌────
  │ open! Async
  │ 
  │ let main () =
  │   let rec loop () =
  │     Deferred.return ()
  │     >>= fun () ->
  │     loop ()
  │   in
  │   don't_wait_for (loop ());
  │   printf "this line does print!\n";
  │   return ()
  │ ;;
  │ 
  │ let () =
  │   let cmd = Command.async_spec ~summary:"" Command.Spec.empty main in
  │   Command.run cmd
  │ ;;
  └────

  Fortunately there's a workaround. You can get something closer to the
  Async-style behavior in Lwt by using `Lwt.yield ()' instead of
  `Lwt.return ()'.


Spawning threads
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  From time to time you may need to run something in a system thread.
  In Async you say `In_thread.run', whereas in Lwt you say
  `Lwt_preemptive.detach'.  For simple things they're pretty much
  interchangeable, but one stumbling point for me was that in Async you
  can create a named thread and always use that for the `In_thread.run',
  with multiple simultaneous dispatches to that thread becoming
  sequenced.

  This is really useful for interacting with libraries that aren't so
  thread friendly.

  Lwt's detach doesn't provide an easy way to do this out of the box,
  but I think you can still deal with thread unfriendly libraries by
  using the `Lwt_preemptive.run_in_main' call.

  Basically, never exit the detach thread you started to interact with
  your library, and instead have it block on promise that gets filled
  through run_in_main.  In this way you can sequence your detached Lwt
  thread similarly to Async.

  Happy to explain further if this is unclear.


Other libraries
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  `Async.Unix' has a somewhat built-up conception of the UNIX API,
  whereas `Lwt_main' is more a direct mapping of ocaml's `Unix' module
  to promises.

  Async `Clock.every' and `Clock.after' don't have exact analogs, but
  you can make new versions pretty simply.

  Example of a shallow imitation of Async `Clock.every'
  ┌────
  │ let every span f =
  │   Lwt.async (fun () ->
  │     let span = Time.Span.to_sec span in
  │     let rec loop () =
  │       f ();
  │       Lwt_unix.sleep span
  │       >>= fun () ->
  │       loop ()
  │     in
  │     loop ())
  │ ;;
  └────

  *Open questions*

  I haven't sorted out a good Lwt substitute that's as comfortable as
  Async Pipe yet.  Though some combination of Lwt_stream, Lwt_sequence
  and `lwt-pipe' might fit the bill.  If you just happen to know already
  feel free to cluephone.


Closing remarks
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  This is basically everything?  I'm almost suspicious that I'm not
  having more problems, but will happily accept grace when it arises.


Raphaël Proust then said
────────────────────────

        I haven’t sorted out a good Lwt substitute that’s as
        comfortable as Async Pipe yet. Though some combination of
        Lwt_stream, Lwt_sequence and `lwt-pipe' might fit the
        bill. If you just happen to know already feel free to
        cluephone.

  The Tezos project has a pipe-like module:
  [https://gitlab.com/tezos/tezos/-/blob/master/src/lib_stdlib/lwt_pipe.mli]
  It hasn't been released as a standalone library (yet) but it is
  released as part of the `tezos-stdlib' package.

  I haven't used Async's pipe, so I don't know how close of a match it
  is.


jose 0.4.0
══════════

  Archive: [https://discuss.ocaml.org/t/ann-jose-0-4-0/5909/1]
