2020.06.09.org
** Ulrik Strid announced


A new release of JOSE has been published to opam

The following changes has been made
- RFC7638: Implement thumbprints @undu
- Make kid optional in the header and jwk to align better with the spec, this is a breaking change

I have started dog fooding the library for a OpenID Connect client which hopefully will help with the design going
forward.
      



* OCaml 4.11.0, second alpha release
:PROPERTIES:
:CUSTOM_ID: 5
:END:
Archive: https://discuss.ocaml.org/t/ocaml-4-11-0-second-alpha-release/5910/1

** octachron announced


A new alpha version of OCaml 4.11.0 has been published.
Compared to the first alpha version, this version contains the following new bug
fixes:

- *additional fixes* [[https://github.com/ocaml/ocaml/issues/6673][6673]], [[https://github.com/ocaml/ocaml/issues/1132][1132]], [[https://github.com/ocaml/ocaml/issues/9617][+9617]]: Relax the handling of explicit polymorphic types (Leo White, review by Jacques Garrigue and Gabriel Scherer)

- *additional fixes* [[https://github.com/ocaml/ocaml/issues/7364][7364]], [[https://github.com/ocaml/ocaml/issues/2188][2188]], [[https://github.com/ocaml/ocaml/issues/9592][+9592]], [[https://github.com/ocaml/ocaml/issues/9609][+9609]]: improvement of the unboxability check for types with a single constructor. Mutually-recursive type declarations can now contain unboxed types. This is based on the paper https://arxiv.org/abs/1811.02300

- [[https://github.com/ocaml/ocaml/issues/7817][7817]], [[https://github.com/ocaml/ocaml/issues/9546][9546]]: Unsound inclusion check for polymorphic variant (Jacques Garrigue, report by Mikhail Mandrykin, review by Gabriel Scherer)

- [[https://github.com/ocaml/ocaml/issues/9549][9549]], [[https://github.com/ocaml/ocaml/issues/9557][9557]]: Make -flarge-toc the default for PowerPC and introduce -fsmall-toc to enable the previous behaviour. (David Allsopp, report by Nathaniel Wesley Filardo, review by Xavier Leroy)

- [[https://github.com/ocaml/ocaml/issues/9320][9320]], [[https://github.com/ocaml/ocaml/issues/9550][9550]]: under Windows, make sure that the Unix.exec* functions properly quote their argument lists. (Xavier Leroy, report by André Maroneze, review by Nicolás Ojeda Bär and David Allsopp)

- [[https://github.com/ocaml/ocaml/issues/9490][9490]], [[https://github.com/ocaml/ocaml/issues/9505][9505]]: ensure proper rounding of file times returned by Unix.stat, Unix.lstat, Unix.fstat. (Xavier Leroy and Guillaume Melquiond, report by David Brown, review by Gabriel Scherer and David Allsopp)

- [[https://github.com/ocaml/ocaml/issues/8676][8676]], [[https://github.com/ocaml/ocaml/issues/9594][9594]]: turn debugger off in programs launched by the program being debugged (Xavier Leroy, report by Michael Soegtrop, review by Gabriel Scherer)

- [[https://github.com/ocaml/ocaml/issues/9552][9552]]: restore ocamloptp build and installation (Florian Angeletti, review by David Allsopp and Xavier Leroy)

- [[https://github.com/ocaml/ocaml/issues/7708][7708]], [[https://github.com/ocaml/ocaml/issues/9580][9580]]: Ensure Stdlib documentation index refers to Stdlib. (Stephen Dolan, review by Florian Angeletti, report by Hannes Mehnert)

- [[https://github.com/ocaml/ocaml/issues/9189][9189]], [[https://github.com/ocaml/ocaml/issues/9281][9281]]: fix a conflict with Gentoo build system by removing an one-letter Makefile variable. (Florian Angeletti, report by Ralph Seichter, review by David Allsopp and Damien Doligez)

The compiler can be installed as an OPAM switch with one of the following commands
#+begin_src shell
opam switch create ocaml-variants.4.11.0+alpha2 --repositories=default,beta=git+https://github.com/ocaml/ocaml-beta-repository.git
#+end_src
or
#+begin_src shell
opam switch create ocaml-variants.4.11.0+alpha2+<VARIANT> --repositories=default,beta=git+https://github.com/ocaml/ocaml-beta-repository.git
#+end_src
where <VARIANT> is replaced with one of these: afl, flambda, fp, fp+flambda

The source code for the alpha is also available at these addresses:

- https://github.com/ocaml/ocaml/archive/4.11.0+alpha2.tar.gz
- https://caml.inria.fr/pub/distrib/ocaml-4.11/ocaml-4.11.0+alpha2.tar.gz

If you find any bugs, please report them here:
 https://github.com/ocaml/ocaml/issues
      



* OCaml Workshop 2020: Call for Volunteers
:PROPERTIES:
:CUSTOM_ID: 6
:END:
Archive: https://discuss.ocaml.org/t/ocaml-workshop-2020-call-for-volunteers/5913/1

