2020.06.09.html

<div id="outline-container-org5b2777d" class="outline-3">
<h3 id="org5b2777d">Ulrik Strid announced</h3>
<div class="outline-text-3" id="text-org5b2777d">
<p>
A new release of JOSE has been published to opam
</p>

<p>
The following changes has been made
</p>
<ul class="org-ul">
<li>RFC7638: Implement thumbprints @undu</li>
<li>Make kid optional in the header and jwk to align better with the spec, this is a breaking change</li>
</ul>

<p>
I have started dog fooding the library for a OpenID Connect client which hopefully will help with the design going
forward.
</p>
</div>
</div>
</div>




<div id="outline-container-orgaa771b6" class="outline-2">
<h2 id="5"><a id="orgaa771b6"></a>OCaml 4.11.0, second alpha release</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-4-11-0-second-alpha-release/5910/1">https://discuss.ocaml.org/t/ocaml-4-11-0-second-alpha-release/5910/1</a>
</p>
</div>

<div id="outline-container-org537443e" class="outline-3">
<h3 id="org537443e">octachron announced</h3>
<div class="outline-text-3" id="text-org537443e">
<p>
A new alpha version of OCaml 4.11.0 has been published.
Compared to the first alpha version, this version contains the following new bug
fixes:
</p>

<ul class="org-ul">
<li><b>additional fixes</b> <a href="https://github.com/ocaml/ocaml/issues/6673">6673</a>, <a href="https://github.com/ocaml/ocaml/issues/1132">1132</a>, <a href="https://github.com/ocaml/ocaml/issues/9617">+9617</a>: Relax the handling of explicit polymorphic types (Leo White, review by Jacques Garrigue and Gabriel Scherer)</li>

<li><b>additional fixes</b> <a href="https://github.com/ocaml/ocaml/issues/7364">7364</a>, <a href="https://github.com/ocaml/ocaml/issues/2188">2188</a>, <a href="https://github.com/ocaml/ocaml/issues/9592">+9592</a>, <a href="https://github.com/ocaml/ocaml/issues/9609">+9609</a>: improvement of the unboxability check for types with a single constructor. Mutually-recursive type declarations can now contain unboxed types. This is based on the paper <a href="https://arxiv.org/abs/1811.02300">https://arxiv.org/abs/1811.02300</a></li>

<li><a href="https://github.com/ocaml/ocaml/issues/7817">7817</a>, <a href="https://github.com/ocaml/ocaml/issues/9546">9546</a>: Unsound inclusion check for polymorphic variant (Jacques Garrigue, report by Mikhail Mandrykin, review by Gabriel Scherer)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/9549">9549</a>, <a href="https://github.com/ocaml/ocaml/issues/9557">9557</a>: Make -flarge-toc the default for PowerPC and introduce -fsmall-toc to enable the previous behaviour. (David Allsopp, report by Nathaniel Wesley Filardo, review by Xavier Leroy)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/9320">9320</a>, <a href="https://github.com/ocaml/ocaml/issues/9550">9550</a>: under Windows, make sure that the Unix.exec* functions properly quote their argument lists. (Xavier Leroy, report by André Maroneze, review by Nicolás Ojeda Bär and David Allsopp)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/9490">9490</a>, <a href="https://github.com/ocaml/ocaml/issues/9505">9505</a>: ensure proper rounding of file times returned by Unix.stat, Unix.lstat, Unix.fstat. (Xavier Leroy and Guillaume Melquiond, report by David Brown, review by Gabriel Scherer and David Allsopp)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/8676">8676</a>, <a href="https://github.com/ocaml/ocaml/issues/9594">9594</a>: turn debugger off in programs launched by the program being debugged (Xavier Leroy, report by Michael Soegtrop, review by Gabriel Scherer)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/9552">9552</a>: restore ocamloptp build and installation (Florian Angeletti, review by David Allsopp and Xavier Leroy)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/7708">7708</a>, <a href="https://github.com/ocaml/ocaml/issues/9580">9580</a>: Ensure Stdlib documentation index refers to Stdlib. (Stephen Dolan, review by Florian Angeletti, report by Hannes Mehnert)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/9189">9189</a>, <a href="https://github.com/ocaml/ocaml/issues/9281">9281</a>: fix a conflict with Gentoo build system by removing an one-letter Makefile variable. (Florian Angeletti, report by Ralph Seichter, review by David Allsopp and Damien Doligez)</li>
</ul>

<p>
The compiler can be installed as an OPAM switch with one of the following commands
</p>
<div class="org-src-container">
<pre class="src src-shell">opam switch create ocaml-variants.4.11.0+alpha2 --repositories=default,<span style="color: #a0522d;">beta</span>=git+https://github.com/ocaml/ocaml-beta-repository.git
</pre>
</div>
<p>
or
</p>
<div class="org-src-container">
<pre class="src src-shell">opam switch create ocaml-variants.4.11.0+alpha2+&lt;VARIANT&gt; --repositories=default,<span style="color: #a0522d;">beta</span>=git+https://github.com/ocaml/ocaml-beta-repository.git
</pre>
</div>
<p>
where &lt;VARIANT&gt; is replaced with one of these: afl, flambda, fp, fp+flambda
</p>

<p>
The source code for the alpha is also available at these addresses:
</p>

<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/archive/4.11.0+alpha2.tar.gz">https://github.com/ocaml/ocaml/archive/4.11.0+alpha2.tar.gz</a></li>
<li><a href="https://caml.inria.fr/pub/distrib/ocaml-4.11/ocaml-4.11.0+alpha2.tar.gz">https://caml.inria.fr/pub/distrib/ocaml-4.11/ocaml-4.11.0+alpha2.tar.gz</a></li>
</ul>

<p>
If you find any bugs, please report them here:
 <a href="https://github.com/ocaml/ocaml/issues">https://github.com/ocaml/ocaml/issues</a>
</p>
</div>
</div>
</div>




<div id="outline-container-org3a8f80e" class="outline-2">
<h2 id="6"><a id="org3a8f80e"></a>OCaml Workshop 2020: Call for Volunteers</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-workshop-2020-call-for-volunteers/5913/1">https://discuss.ocaml.org/t/ocaml-workshop-2020-call-for-volunteers/5913/1</a>
</p>
</div>
