2020.06.09.html

<div id="outline-container-org139d28e" class="outline-3">
<h3 id="org139d28e">Ivan Gotovchits announced</h3>
<div class="outline-text-3" id="text-org139d28e">
<p>
The OCaml Workshop will be held in the virtual format this year, which poses new challenges and requires people with
special talents and training. The Organizing Committee is seeking for members who will volunteer to fill one (or
more) of the following roles:
</p>

<ol class="org-ol">
<li>AV Editor</li>
<li>Session Host</li>
<li>Transcribers/Interpreter</li>
<li>Content Manager</li>
<li>Accessibility Chair</li>
</ol>

<p>
The roles are described in details below. We are asking prospective Organizing Committee members to contact the
Organizing Committee chair ([ivg@ieee.org](<a href="mailto:ivg@ieee.org">mailto:ivg@ieee.org</a>)), indicating which role(s) they are ready to take.
</p>
</div>

<div id="outline-container-org76e71a7" class="outline-4">
<h4 id="org76e71a7"><a href="https://icfp20.sigplan.org/home/ocaml-2020#av-editor">AV Editor</a></h4>
<div class="outline-text-4" id="text-org76e71a7">
<p>
AV (Audio/Video) editors are responsible for previewing the presentations and providing help and feedback to the
authors. Ideally we target for one editor per talk.
</p>
</div>

<ul class="org-ul">
<li><a id="org9b71712"></a><a href="https://icfp20.sigplan.org/home/ocaml-2020#duties">Duties</a><br />
<div class="outline-text-5" id="text-org9b71712">
<ul class="org-ul">
<li>Preview and (if necessary) post-process or (ask the author to shoot again) the pre-recorded videos.</li>
<li>Advise authors and help in choice of software and hardware, teach how to set up the camera, light, make sure that the audio is of good quality and, in general, channel our quality guidelines.</li>
<li>Ensure that all videos are of the same quality, the audio levels are the same, and that everything is loud and clear.</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgf12f23f" class="outline-4">
<h4 id="orgf12f23f"><a href="https://icfp20.sigplan.org/home/ocaml-2020#session-hosts">Session Hosts</a></h4>
<div class="outline-text-4" id="text-orgf12f23f">
<p>
Session hosts will assist session chairs in streaming the pre-recorded videos as well as helping and moderating the
Q&amp;A sessions and the panel session. They will also be responsible for security and be ready to react to potential
threats and wrongdoers. Since we will broadcast sessions in several time zones we need several hosts for each
session.
</p>
</div>

<ul class="org-ul">
<li><a id="org8f5e868"></a><a href="https://icfp20.sigplan.org/home/ocaml-2020#duties">Duties</a><br />
<div class="outline-text-5" id="text-org8f5e868">
<ul class="org-ul">
<li>Moderating the text chats</li>
<li>Controlling microphones in the video-conferencing</li>
<li>Watching for the time</li>
<li>Performing sound checks</li>
<li>Welcoming and otherwise guiding participants</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org3a81f0e" class="outline-4">
<h4 id="org3a81f0e"><a href="https://icfp20.sigplan.org/home/ocaml-2020#transcribers-interpreters">Transcribers / Interpreters</a></h4>
<div class="outline-text-4" id="text-org3a81f0e">
<p>
We would like to have at least English transcriptions for each talk and translations to other languages are very
welcome. Transcriptions enable accessibility as well as potentially increase the audience and publicity as they could
be indexed by the search engines.
</p>
</div>

<ul class="org-ul">
<li><a id="orgff393d3"></a><a href="https://icfp20.sigplan.org/home/ocaml-2020#duties">Duties</a><br />
<div class="outline-text-5" id="text-orgff393d3">
<ul class="org-ul">
<li>Create transcriptions for videos, potentially in other languages.</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org5bc2ed8" class="outline-4">
<h4 id="org5bc2ed8"><a href="https://icfp20.sigplan.org/home/ocaml-2020#content-manager">Content Manager</a></h4>
<div class="outline-text-4" id="text-org5bc2ed8">
<p>
The content manager will be responsible for maintaining the web presence of the conference on <a href="https://ocaml.org/">https://ocaml.org/</a>. We
plan to have all videos available, as well as maintain a page for each submitted work.
</p>
</div>
</div>

<div id="outline-container-org7843025" class="outline-4">
<h4 id="org7843025"><a href="https://icfp20.sigplan.org/home/ocaml-2020#accessibility-chair">Accessibility Chair</a></h4>
<div class="outline-text-4" id="text-org7843025">
<p>
We are striving to make the conference accessible to everyone and we are looking for volunteers who have experience
in online accessibility.
</p>
</div>

<ul class="org-ul">
<li><a id="org0f1acb5"></a><a href="https://icfp20.sigplan.org/home/ocaml-2020#duties">Duties</a><br />
<div class="outline-text-5" id="text-org0f1acb5">
<ul class="org-ul">
<li>Helping with the selection of accessible platforms and tools.</li>
<li>Working with attendees to ensure the necessary access services are included.</li>
<li>Establishing best practices for preparing and running accessible sessions.</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-orgeaacc43" class="outline-2">
<h2 id="7"><a id="orgeaacc43"></a>Introduction to Lwt</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/introduction-to-lwt/5940/1">https://discuss.ocaml.org/t/introduction-to-lwt/5940/1</a>
</p>
</div>

<div id="outline-container-org12182ae" class="outline-3">
<h3 id="org12182ae">Raphaël Proust announced</h3>
<div class="outline-text-3" id="text-org12182ae">
<p>
I've published <a href="https://raphael-proust.github.io/code/lwt-part-1.html">https://raphael-proust.github.io/code/lwt-part-1.html</a>, a 2-part introduction to Lwt.
</p>

<p>
The main aim of the introduction is to give a good mental model of what promises are, how they behave and how to use
them. It assumes basic familiarity with OCaml.
</p>

<p>
Don't hesitate to ask questions or share feedback.
</p>
</div>
</div>
</div>




<div id="outline-container-org0c374a4" class="outline-2">
<h2 id="8"><a id="org0c374a4"></a>Other OCaml News</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgccd6c2b" class="outline-3">
<h3 id="orgccd6c2b">From the ocamlcore planet blog</h3>
<div class="outline-text-3" id="text-orgccd6c2b">
<p>
Here are links from many OCaml blogs aggregated at <a href="http://ocaml.org/community/planet/">OCaml Planet</a>.
</p>

<ul class="org-ul">
<li><a href="https://blog.janestreet.com/using-ascii-waveforms-to-test-hardware-designs/">Using ASCII waveforms to test hardware designs</a></li>
</ul>
</div>
</div>
</div>
