2020.06.09.txt

  The OCaml Workshop will be held in the virtual format this year, which
  poses new challenges and requires people with special talents and
  training. The Organizing Committee is seeking for members who will
  volunteer to fill one (or more) of the following roles:

  1. AV Editor
  2. Session Host
  3. Transcribers/Interpreter
  4. Content Manager
  5. Accessibility Chair

  The roles are described in details below. We are asking prospective
  Organizing Committee members to contact the Organizing Committee chair
  ([ivg@ieee.org]([mailto:ivg@ieee.org])), indicating which role(s) they
  are ready to take.


[AV Editor]
╌╌╌╌╌╌╌╌╌╌╌

  AV (Audio/Video) editors are responsible for previewing the
  presentations and providing help and feedback to the authors. Ideally
  we target for one editor per talk.


[AV Editor] https://icfp20.sigplan.org/home/ocaml-2020#av-editor

◊ [Duties]

  • Preview and (if necessary) post-process or (ask the author to shoot
    again) the pre-recorded videos.
  • Advise authors and help in choice of software and hardware, teach
    how to set up the camera, light, make sure that the audio is of good
    quality and, in general, channel our quality guidelines.
  • Ensure that all videos are of the same quality, the audio levels are
    the same, and that everything is loud and clear.


  [Duties] https://icfp20.sigplan.org/home/ocaml-2020#duties


[Session Hosts]
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  Session hosts will assist session chairs in streaming the pre-recorded
  videos as well as helping and moderating the Q&A sessions and the
  panel session. They will also be responsible for security and be ready
  to react to potential threats and wrongdoers. Since we will broadcast
  sessions in several time zones we need several hosts for each session.


[Session Hosts] https://icfp20.sigplan.org/home/ocaml-2020#session-hosts

◊ [Duties]

  • Moderating the text chats
  • Controlling microphones in the video-conferencing
  • Watching for the time
  • Performing sound checks
  • Welcoming and otherwise guiding participants


  [Duties] https://icfp20.sigplan.org/home/ocaml-2020#duties


[Transcribers / Interpreters]
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  We would like to have at least English transcriptions for each talk
  and translations to other languages are very welcome. Transcriptions
  enable accessibility as well as potentially increase the audience and
  publicity as they could be indexed by the search engines.


[Transcribers / Interpreters]
https://icfp20.sigplan.org/home/ocaml-2020#transcribers-interpreters

◊ [Duties]

  • Create transcriptions for videos, potentially in other languages.


  [Duties] https://icfp20.sigplan.org/home/ocaml-2020#duties


[Content Manager]
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  The content manager will be responsible for maintaining the web
  presence of the conference on [https://ocaml.org/]. We plan to have
  all videos available, as well as maintain a page for each submitted
  work.


[Content Manager]
https://icfp20.sigplan.org/home/ocaml-2020#content-manager


[Accessibility Chair]
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  We are striving to make the conference accessible to everyone and we
  are looking for volunteers who have experience in online
  accessibility.


[Accessibility Chair]
https://icfp20.sigplan.org/home/ocaml-2020#accessibility-chair

◊ [Duties]

  • Helping with the selection of accessible platforms and tools.
  • Working with attendees to ensure the necessary access services are
    included.
  • Establishing best practices for preparing and running accessible
    sessions.


  [Duties] https://icfp20.sigplan.org/home/ocaml-2020#duties


Introduction to Lwt
═══════════════════

  Archive: [https://discuss.ocaml.org/t/introduction-to-lwt/5940/1]


Raphaël Proust announced
────────────────────────

  I've published
  [https://raphael-proust.github.io/code/lwt-part-1.html], a 2-part
  introduction to Lwt.

  The main aim of the introduction is to give a good mental model of
  what promises are, how they behave and how to use them. It assumes
  basic familiarity with OCaml.

  Don't hesitate to ask questions or share feedback.


Other OCaml News
════════════════

From the ocamlcore planet blog
──────────────────────────────

  Here are links from many OCaml blogs aggregated at [OCaml Planet].

  • [Using ASCII waveforms to test hardware designs]


[OCaml Planet] http://ocaml.org/community/planet/

[Using ASCII waveforms to test hardware designs]
https://blog.janestreet.com/using-ascii-waveforms-to-test-hardware-designs/


Old CWN
═══════
